AWS have deployed a fix for this and I have verified that creating a bucket with the following config now succeeds:

```hcl
resource "awscc_s3_bucket" "name" {
}
```

```console
terraform apply --auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are
indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # awscc_s3_bucket.name will be created
  + resource "awscc_s3_bucket" "name" {
      + accelerate_configuration           = {
          + acceleration_status = (known after apply)
        } -> (known after apply)
      + access_control                     = (known after apply)
      + analytics_configurations           = [
        ] -> (known after apply)
      + arn                                = (known after apply)
      + bucket_encryption                  = {
          + server_side_encryption_configuration = [
            ] -> (known after apply)
        } -> (known after apply)
      + bucket_name                        = (known after apply)
      + cors_configuration                 = {
          + cors_rules = [
            ] -> (known after apply)
        } -> (known after apply)
      + domain_name                        = (known after apply)
      + dual_stack_domain_name             = (known after apply)
      + id                                 = (known after apply)
      + intelligent_tiering_configurations = [
        ] -> (known after apply)
      + inventory_configurations           = [
        ] -> (known after apply)
      + lifecycle_configuration            = {
          + rules = [
            ] -> (known after apply)
        } -> (known after apply)
      + logging_configuration              = {
          + destination_bucket_name = (known after apply)
          + log_file_prefix         = (known after apply)
        } -> (known after apply)
      + metrics_configurations             = [
        ] -> (known after apply)
      + notification_configuration         = {
          + event_bridge_configuration = {
              + event_bridge_enabled = (known after apply)
            } -> (known after apply)
          + lambda_configurations      = [
            ] -> (known after apply)
          + queue_configurations       = [
            ] -> (known after apply)
          + topic_configurations       = [
            ] -> (known after apply)
        } -> (known after apply)
      + object_lock_configuration          = {
          + object_lock_enabled = (known after apply)
          + rule                = {
              + default_retention = {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                } -> (known after apply)
            } -> (known after apply)
        } -> (known after apply)
      + object_lock_enabled                = (known after apply)
      + ownership_controls                 = {
          + rules = [
            ] -> (known after apply)
        } -> (known after apply)
      + public_access_block_configuration  = {
          + block_public_acls       = (known after apply)
          + block_public_policy     = (known after apply)
          + ignore_public_acls      = (known after apply)
          + restrict_public_buckets = (known after apply)
        } -> (known after apply)
      + regional_domain_name               = (known after apply)
      + replication_configuration          = {
          + role  = (known after apply)
          + rules = [
            ] -> (known after apply)
        } -> (known after apply)
      + tags                               = [
        ] -> (known after apply)
      + versioning_configuration           = {
          + status = (known after apply)
        } -> (known after apply)
      + website_configuration              = {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = {
              + host_name = (known after apply)
              + protocol  = (known after apply)
            } -> (known after apply)
          + routing_rules            = [
            ] -> (known after apply)
        } -> (known after apply)
      + website_url                        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
awscc_s3_bucket.name: Creating...
awscc_s3_bucket.name: Still creating... [10s elapsed]
awscc_s3_bucket.name: Still creating... [20s elapsed]
awscc_s3_bucket.name: Creation complete after 24s [id=9z50r49dqceqxzeaazqotwiey-qlskzqlrewrz]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```